*** services/api/src/lib.rs:35:5: replace ensure_data_dirs -> Result<(), std::io::Error> with Ok(())

*** mutation diff:
--- services/api/src/lib.rs
+++ replace ensure_data_dirs -> Result<(), std::io::Error> with Ok(())
@@ -27,29 +27,17 @@
 #[derive(Embed)]
 #[folder = "../../apps/web/build"]
 struct SpaAssets;
 
 /// Create the required data directories: data_dir, data_dir/logs/, data_dir/backups/.
 ///
 /// Returns an error with the path included in the message on failure.
 pub fn ensure_data_dirs(data_dir: &Path) -> Result<(), std::io::Error> {
-    for dir in [
-        data_dir.to_path_buf(),
-        data_dir.join("logs"),
-        data_dir.join("backups"),
-    ] {
-        std::fs::create_dir_all(&dir).map_err(|e| {
-            std::io::Error::new(
-                e.kind(),
-                format!("Failed to create directory {}: {}", dir.display(), e),
-            )
-        })?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Attempt to bind a TCP listener, trying ports from `port` through `port + 10`.
 ///
 /// Returns the listener and the actual port that was bound. Logs at INFO when
 /// a port is successfully bound. Returns an error if all 11 ports are exhausted.
 pub async fn try_bind(
     host: &str,

---- ensure_data_dirs_returns_error_with_path_on_read_only_directory stdout ----

thread 'ensure_data_dirs_returns_error_with_path_on_read_only_directory' (29182351) panicked at services/api/tests/error_handling.rs:16:5:
should fail on read-only path

---- graceful_shutdown_completes_cleanly stdout ----

thread 'graceful_shutdown_completes_cleanly' (29182352) panicked at services/api/tests/error_handling.rs:35:68:
called `Result::unwrap()` on an `Err` value: Database(SqliteError { code: 14, message: "unable to open database file" })

failures:
    ensure_data_dirs_returns_error_with_path_on_read_only_directory
    graceful_shutdown_completes_cleanly

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
